GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_usart.h
/* USART5 bits definitions */
/* USART5_CTL0 */
#define USART5_CTL0_UEN                BIT(0)           /*!< USART5 enable */
#define USART5_CTL0_UESM               BIT(1)           /*!< USART5 enable in Deep-sleep mode */
#define USART5_CTL0_REN                BIT(2)           /*!< receiver enable */
#define USART5_CTL0_TEN                BIT(3)           /*!< transmitter enable */
#define USART5_CTL0_IDLEIE             BIT(4)           /*!< idle line detected interrupt enable */
#define USART5_CTL0_RBNEIE             BIT(5)           /*!< read data buffer not empty interrupt and overrun error interrupt enable */
#define USART5_CTL0_TCIE               BIT(6)           /*!< transmission complete interrupt enable */
#define USART5_CTL0_TBEIE              BIT(7)           /*!< transmitter buffer empty interrupt enable */
#define USART5_CTL0_PERRIE             BIT(8)           /*!< parity error interrupt enable */
#define USART5_CTL0_PM                 BIT(9)           /*!< parity mode */
#define USART5_CTL0_PCEN               BIT(10)          /*!< parity check function enable */
#define USART5_CTL0_WM                 BIT(11)          /*!< wakeup method in mute mode */
#define USART5_CTL0_WL                 BIT(12)          /*!< word length */
#define USART5_CTL0_MEN                BIT(13)          /*!< mute mode enable */
#define USART5_CTL0_AMIE               BIT(14)          /*!< ADDR match interrupt enable */
#define USART5_CTL0_OVSMOD             BIT(15)          /*!< oversample mode */
#define USART5_CTL0_RTIE               BIT(26)          /*!< receiver timeout interrupt enable */
#define USART5_CTL0_EBIE               BIT(27)          /*!< End of Block interrupt enable */

/* USART5_CTL1 */
#define USART5_CTL1_ADDM               BIT(4)           /*!< address detection mode */
#define USART5_CTL1_LBLEN              BIT(5)           /*!< LIN break frame length */
#define USART5_CTL1_LBDIE              BIT(6)           /*!< LIN break detection interrupt enable */
#define USART5_CTL1_CLEN               BIT(8)           /*!< last bit clock pulse */
#define USART5_CTL1_CPH                BIT(9)           /*!< clock phase */
#define USART5_CTL1_CPL                BIT(10)          /*!< clock polarity */
#define USART5_CTL1_CKEN               BIT(11)          /*!< ck pin enable */
#define USART5_CTL1_STB                BITS(12,13)      /*!< stop bits length */
#define USART5_CTL1_LMEN               BIT(14)          /*!< LIN mode enable */
#define USART5_CTL1_STRP               BIT(15)          /*!< swap TX/RX pins */
#define USART5_CTL1_RINV               BIT(16)          /*!< RX pin level inversion */
#define USART5_CTL1_TINV               BIT(17)          /*!< TX pin level inversion */
#define USART5_CTL1_DINV               BIT(18)          /*!< data bit level inversion */
#define USART5_CTL1_MSBF               BIT(19)          /*!< most significant bit first */
#define USART5_CTL1_RTEN               BIT(23)          /*!< receiver timeout enable */
#define USART5_CTL1_ADDR               BITS(24,31)      /*!< address of the USART terminal */

/* USART5_CTL2 */
#define USART5_CTL2_ERRIE              BIT(0)           /*!< error interrupt enable in multibuffer communication */
#define USART5_CTL2_IREN               BIT(1)           /*!< IrDA mode enable */
#define USART5_CTL2_IRLP               BIT(2)           /*!< IrDA low-power */
#define USART5_CTL2_HDEN               BIT(3)           /*!< half-duplex enable */
#define USART5_CTL2_NKEN               BIT(4)           /*!< NACK enable in smartcard mode */
#define USART5_CTL2_SCEN               BIT(5)           /*!< smartcard mode enable */
#define USART5_CTL2_DENR               BIT(6)           /*!< DMA enable for reception */
#define USART5_CTL2_DENT               BIT(7)           /*!< DMA enable for transmission */
#define USART5_CTL2_OSB                BIT(11)          /*!< one sample bit mode */
#define USART5_CTL2_OVRD               BIT(12)          /*!< overrun disable */
#define USART5_CTL2_DDRE               BIT(13)          /*!< disable DMA on reception error */
#define USART5_CTL2_SCRTNUM            BITS(17,19)      /*!< smartcard auto-retry number */
#define USART5_CTL2_WUM                BITS(20,21)      /*!< wakeup mode from deep-sleep mode */
#define USART5_CTL2_WUIE               BIT(22)          /*!< wakeup from deep-sleep mode interrupt enable */

/* USART5_BAUD */
#define USART5_BAUD_FRADIV             BITS(0,3)        /*!< fraction of baud-rate divider */
#define USART5_BAUD_INTDIV             BITS(4,15)       /*!< integer of baud-rate divider */

/* USART5_GP */
#define USART5_GP_PSC                  BITS(0,7)        /*!< prescaler value for dividing the system clock */
#define USART5_GP_GUAT                 BITS(8,15)       /*!< guard time value in smartcard mode */

/* USART5_RT */
#define USART5_RT_RT                   BITS(0,23)       /*!< receiver timeout threshold */
#define USART5_RT_BL                   BITS(24,31)      /*!< block length */

/* USART5_CMD */
#define USART5_CMD_SBKCMD              BIT(1)           /*!< send break command */
#define USART5_CMD_MMCMD               BIT(2)           /*!< mute mode command */
#define USART5_CMD_RXFCMD              BIT(3)           /*!< receive data flush command */
#define USART5_CMD_TXFCMD              BIT(4)           /*!< transmit data flush request */

/* USART5_STAT */
#define USART5_STAT_PERR               BIT(0)           /*!< parity error flag */
#define USART5_STAT_FERR               BIT(1)           /*!< frame error flag */
#define USART5_STAT_NERR               BIT(2)           /*!< noise error flag */
#define USART5_STAT_ORERR              BIT(3)           /*!< overrun error */
#define USART5_STAT_IDLEF              BIT(4)           /*!< idle line detected flag */
#define USART5_STAT_RBNE               BIT(5)           /*!< read data buffer not empty */
#define USART5_STAT_TC                 BIT(6)           /*!< transmission completed */
#define USART5_STAT_TBE                BIT(7)           /*!< transmit data register empty */
#define USART5_STAT_LBDF               BIT(8)           /*!< LIN break detected flag */
#define USART5_STAT_RTF                BIT(11)          /*!< receiver timeout flag */
#define USART5_STAT_EBF                BIT(12)          /*!< end of block flag */
#define USART5_STAT_BSY                BIT(16)          /*!< busy flag */
#define USART5_STAT_AMF                BIT(17)          /*!< address match flag */
#define USART5_STAT_SBF                BIT(18)          /*!< send break flag */
#define USART5_STAT_RWU                BIT(19)          /*!< receiver wakeup from mute mode */
#define USART5_STAT_WUF                BIT(20)          /*!< wakeup from deep-sleep mode flag */
#define USART5_STAT_TEA                BIT(21)          /*!< transmit enable acknowledge flag */
#define USART5_STAT_REA                BIT(22)          /*!< receive enable acknowledge flag */

/* USART5_INTC */
#define USART5_INTC_PEC                BIT(0)           /*!< parity error clear */
#define USART5_INTC_FEC                BIT(1)           /*!< frame error flag clear */
#define USART5_INTC_NEC                BIT(2)           /*!< noise detected clear */
#define USART5_INTC_OREC               BIT(3)           /*!< overrun error clear */
#define USART5_INTC_IDLEC              BIT(4)           /*!< idle line detected clear */
#define USART5_INTC_TCC                BIT(6)           /*!< transmission complete clear */
#define USART5_INTC_LBDC               BIT(8)           /*!< LIN break detected clear */
#define USART5_INTC_RTC                BIT(11)          /*!< receiver timeout clear */
#define USART5_INTC_EBC                BIT(12)          /*!< end of timeout clear */
#define USART5_INTC_AMC                BIT(17)          /*!< address match clear */
#define USART5_INTC_WUC                BIT(20)          /*!< wakeup from deep-sleep mode clear */

/* USART5_RDATA */
#define USART5_RDATA_RDATA             BITS(0,8)        /*!< receive data value */

/* USART5_TDATA */
#define USART5_TDATA_TDATA             BITS(0,8)        /*!< transmit data value */

/* USART5_CHC */
#define USART5_CHC_EPERR               BIT(8)           /*!< early parity error flag */

/* USART5_RFCS */
#define USART5_RFCS_ELNACK             BIT(0)           /*!< early NACK */
#define USART5_RFCS_RFEN               BIT(8)           /*!< receive FIFO enable */
#define USART5_RFCS_RFFIE              BIT(9)           /*!< receive FIFO full interrupt enable */
#define USART5_RFCS_RFE                BIT(10)          /*!< receive FIFO empty flag */
#define USART5_RFCS_RFF                BIT(11)          /*!< receive FIFO full flag */
#define USART5_RFCS_RFCNT              BITS(12,14)      /*!< receive FIFO counter number */
#define USART5_RFCS_RFFINT             BIT(15)          /*!< receive FIFO full interrupt flag */

