GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_usart.h
/* configure USART transmitter */
#define CTL0_TEN(regval)              (BIT(3) & ((uint32_t)(regval) << 3))
#define USART_TRANSMIT_ENABLE         CTL0_TEN(1)                          /*!< enable transmitter */
#define USART_TRANSMIT_DISABLE        CTL0_TEN(0)                          /*!< disable transmitter */

/* USART parity bits definitions */
#define CTL0_PM(regval)               (BITS(9,10) & ((uint32_t)(regval) << 9))
#define USART_PM_NONE                 CTL0_PM(0)                           /*!< no parity */
#define USART_PM_EVEN                 CTL0_PM(2)                           /*!< even parity */
#define USART_PM_ODD                  CTL0_PM(3)                           /*!< odd parity */

/* USART wakeup method in mute mode */
#define CTL0_WM(regval)               (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_WM_IDLE                 CTL0_WM(0)                           /*!< idle Line */
#define USART_WM_ADDR                 CTL0_WM(1)                           /*!< address mask */

/* USART word length definitions */
#define CTL0_WL(regval)               (BIT(12) & ((uint32_t)(regval) << 12))
#define USART_WL_8BIT                 CTL0_WL(0)                           /*!< 8 bits */
#define USART_WL_9BIT                 CTL0_WL(1)                           /*!< 9 bits */

/* USART oversampling mode definitions */
#define CTL0_OVSMOD(regval)           (BIT(15) & ((uint32_t)(regval) << 15))
#define USART_OVSMOD_16               CTL0_OVSMOD(0)                       /*!< 16 bits */
#define USART_OVSMOD_8                CTL0_OVSMOD(1)                       /*!< 8 bits */

/* USART LIN break frame length */
#define CTL1_LBLEN(regval)            (BIT(5) & ((uint32_t)(regval) << 5))
#define USART_LBLEN_10B               CTL1_LBLEN(0)                        /*!< 10 bits */
#define USART_LBLEN_11B               CTL1_LBLEN(1)                        /*!< 11 bits */

/* USART CK length */
#define CTL1_CLEN(regval)             (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_CLEN_NONE               CTL1_CLEN(0)                         /*!< there are 7 CK pulses for an 8 bit frame and 8 CK pulses for a 9 bit frame */
#define USART_CLEN_EN                 CTL1_CLEN(1)                         /*!< there are 8 CK pulses for an 8 bit frame and 9 CK pulses for a 9 bit frame */

/* USART clock phase */
#define CTL1_CPH(regval)              (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CPH_1CK                 CTL1_CPH(0)                          /*!< first clock transition is the first data capture edge */
#define USART_CPH_2CK                 CTL1_CPH(1)                          /*!< second clock transition is the first data capture edge */

/* USART clock polarity */
#define CTL1_CPL(regval)              (BIT(10) & ((uint32_t)(regval) << 10))
#define USART_CPL_LOW                 CTL1_CPL(0)                          /*!< steady low value on CK pin */
#define USART_CPL_HIGH                CTL1_CPL(1)                          /*!< steady high value on CK pin */

/* USART stop bits definitions */
#define CTL1_STB(regval)              (BITS(12,13) & ((uint32_t)(regval) << 12))
#define USART_STB_1BIT                CTL1_STB(0)                          /*!< 1 bit */
#define USART_STB_0_5BIT              CTL1_STB(1)                          /*!< 0.5 bit */
#define USART_STB_2BIT                CTL1_STB(2)                          /*!< 2 bits */
#define USART_STB_1_5BIT              CTL1_STB(3)                          /*!< 1.5 bits */

/* USART IrDA low-power enable */
#define CTL2_IRLP(regval)             (BIT(2) & ((uint32_t)(regval) << 2))
#define USART_IRLP_LOW                CTL2_IRLP(1)                         /*!< low-power */
#define USART_IRLP_NORMAL             CTL2_IRLP(0)                         /*!< normal */

/* configure USART DMA */
#define CLT2_DENR(regval)    (BIT(6) & ((uint32_t)(regval) << 6))
#define USART_RECEIVE_DMA_ENABLE      CLT2_DENR(1)                         /* enable DMA request for reception */
#define USART_RECEIVE_DMA_DISABLE     CLT2_DENR(0)                         /* disable DMA request for reception */

#define CTL2_DENT(regval)   (BIT(7) & ((uint32_t)(regval) << 7))
#define USART_TRANSMIT_DMA_ENABLE     CTL2_DENT(1)                         /* enable DMA request for transmission */
#define USART_TRANSMIT_DMA_DISABLE    CTL2_DENT(0)                         /* disable DMA request for transmission */

/* configure USART RTS */
#define CLT2_RTSEN(regval)            (BIT(8) & ((uint32_t)(regval) << 8))
#define USART_RTS_ENABLE              CLT2_RTSEN(1)                        /*!< enable RTS  */
#define USART_RTS_DISABLE             CLT2_RTSEN(0)                        /*!< disable RTS */

/* configure USART CTS */
#define CLT2_CTSEN(regval)            (BIT(9) & ((uint32_t)(regval) << 9))
#define USART_CTS_ENABLE              CLT2_CTSEN(1)                        /*!< enable CTS */
#define USART_CTS_DISABLE             CLT2_CTSEN(0)                        /*!< disable CTS  */

/* USART one sample bit method configure */
#define CTL2_OSB(regval)              (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_OSB_1bit                CTL2_OSB(1)                          /*!< 1 bit */
#define USART_OSB_3bit                CTL2_OSB(0)                          /*!< 3 bits */

/* USARTx(x=0,1,2)/UARTx(x=3,4) bits configure*/
/* USART data is transmitted/received with the LSB/MSB first */
#define CTL3_MSBF(regval)             (BIT(11) & ((uint32_t)(regval) << 11))
#define USART_MSBF_LSB                CTL3_MSBF(0)                         /*!< LSB first */
#define USART_MSBF_MSB                CTL3_MSBF(1)                         /*!< MSB first */

/* USART collision detection enable */
#define GDCR_CDEN(regval)             (BIT(1) & ((uint32_t)(regval) << 1))
#define USART_CDEN_ENABLE             GDCR_CDEN(1)                         /*!< collision detection enable */
#define USART_CDEN_DISABLE            GDCR_CDEN(0)                         /*!< collision detection disable */

/* USART collision detected interrupt enable */
#define GDCR_CDIE(regval)             (BIT(16) & ((uint32_t)(regval) << 16))
#define USART_CDIE_ENABLE             GDCR_CDIE(1)                         /*!< collision detected interrupt ensable */
#define USART_CDIE_DISABLE            GDCR_CDIE(0)                         /*!< collision detected interrupt disable */

/* USART5 bits configure */
/* USART5 address detection mode */
#define CTL1_ADDM(regval)             (BIT(4) & ((uint32_t)(regval) << 4))
#define USART5_ADDM_4BIT              CTL1_ADDM(0)                         /*!< 4-bit address detection */
#define USART5_ADDM_FULLBIT           CTL1_ADDM(1)                         /*!< full-bit address detection */

/* USART5 data is transmitted/received with the LSB/MSB first */
#define CTL1_MSBF(regval)             (BIT(19) & ((uint32_t)(regval) << 19))
#define USART5_MSBF_LSB               CTL1_MSBF(0)                         /*!< LSB first */
#define USART5_MSBF_MSB               CTL1_MSBF(1)                         /*!< MSB first */

/* USART5 wakeup mode from deep-sleep mode */
#define CTL2_WUM(regval)              (BITS(20,21) & ((uint32_t)(regval) << 20))
#define USART5_WUM_ADDR               CTL2_WUM(0)                          /*!< WUF active on address match */
#define USART5_WUM_STARTB             CTL2_WUM(2)                          /*!< WUF active on start bit */
#define USART5_WUM_RBNE               CTL2_WUM(3)                          /*!< WUF active on RBNE */

/* USARTx(x=0,1,2,5)/UARTx(x=3,4) function declarations */
/* initialization functions */
/* reset USART */
void usart_deinit(uint32_t usart_periph);
/* configure usart baud rate value */
void usart_baudrate_set(uint32_t usart_periph, uint32_t baudval);
/* configure usart parity function */
void usart_parity_config(uint32_t usart_periph, uint32_t paritycfg);
/* configure usart word length */
void usart_word_length_set(uint32_t usart_periph, uint32_t wlen);
/* configure usart stop bit length */
void usart_stop_bit_set(uint32_t usart_periph, uint32_t stblen);
/* enable usart */
void usart_enable(uint32_t usart_periph);
/* disable usart */
void usart_disable(uint32_t usart_periph);
/* configure USART transmitter */
void usart_transmit_config(uint32_t usart_periph, uint32_t txconfig);
/* configure USART receiver */
void usart_receive_config(uint32_t usart_periph, uint32_t rxconfig);

/* normal mode communication */
/* configure the USART oversample mode */
void usart_oversample_config(uint32_t usart_periph, uint32_t oversamp);
/* configure sample bit method */
void usart_sample_bit_config(uint32_t usart_periph, uint32_t obsm);
/* enable receiver timeout */
void usart_receiver_timeout_enable(uint32_t usart_periph);
/* disable receiver timeout */
void usart_receiver_timeout_disable(uint32_t usart_periph);
/* configure receiver timeout threshold */
void usart_receiver_timeout_threshold_config(uint32_t usart_periph, uint32_t rtimeout);
/* USART transmit data function */
void usart_data_transmit(uint32_t usart_periph, uint16_t data);
/* USART receive data function */
uint16_t usart_data_receive(uint32_t usart_periph);

/* multi-processor communication */
/* enable mute mode */
void usart_mute_mode_enable(uint32_t usart_periph);
/* disable mute mode */
void usart_mute_mode_disable(uint32_t usart_periph);
/* configure wakeup method in mute mode */
void usart_mute_mode_wakeup_config(uint32_t usart_periph, uint32_t wmethod);

